# Exploring dataframe

In [31]:
# Importing pandas
import pandas as pd

In [32]:
# Loading data into dataframes
df = pd.read_excel("../Space_Base_Data.xlsx", index_col='Spacecraft')

In [33]:
# Dataframe dimensions
df.shape

(329, 10)

In [34]:
# Information about the diferent columns
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 329 entries, Vostok 1 to SpaceX Demo-2
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Vehicle          329 non-null    object
 1   Launch           329 non-null    datetime64[ns]
 2   Return           328 non-null    datetime64[ns]
 3   Mission Number   329 non-null    int64
 4   Status           329 non-null    object
 5   Earth Orbit      329 non-null    bool
 6   Lunar Orbit      329 non-null    bool
 7   Station Visited  176 non-null    object
 8   Destination      329 non-null    object
 9   Duration (days)  329 non-null    float64
dtypes: bool(2), datetime64[ns](2), float64(1), int64(1), object(4)
memory usage: 23.8+ KB

In [81]:
# Setting how many rows and columns are render
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

In [36]:
# Showing first 5 rows for the dataframe
df.head()

,Vehicle,Launch,Return,Mission Number,Status,Earth Orbit,Lunar Orbit,Station Visited,Destination,Duration (days)
Spacecraft,,,,,,,,,,
Vostok 1,Vostok-K,1961-04-21 06:07:00,1961-04-21 07:55:00,1,Returned,True,False,NaN,Earth Orbit,0.075000
Mercury-Redstone 3,Mercury-Redstone Launch Vehicle,1961-05-05 14:34:13,1961-05-05 14:49:35,2,Returned,False,False,NaN,Non-orbital space,0.010671
Mercury-Redstone 4,Mercury-Redstone Launch Vehicle,1961-07-21 12:20:36,1961-07-21 12:36:13,3,Returned,False,False,NaN,Non-orbital space,0.010845
Vostok 2,Vostok-K,1961-08-06 06:00:00,1961-08-07 07:18:00,4,Returned,True,False,NaN,Earth Orbit,1.054167
Mercury-Atlas 6,Atlas LV-3B,1962-02-20 14:47:39,1962-02-20 19:43:02,5,Returned,True,False,NaN,Earth Orbit,0.205127

In [37]:
# Count frecuency of a specific row
df['Earth Orbit'].value_counts()

True     319
False     10
Name: Earth Orbit, dtype: int64

# Filters

In [43]:
df[df['Destination'] == "Moon"]['Return']

Spacecraft
Apollo 8    1968-12-27 15:52:00
Apollo 10   1969-05-26 16:52:00
                    ...
Apollo 16   1972-04-27 19:45:00
Apollo 17   1972-12-19 19:25:00
Name: Return, Length: 9, dtype: datetime64[ns]

In [99]:
filt = ((df['Destination'] == "Mir") & ((df['Vehicle'] != 'Soyuz-U') & (df['Vehicle'] != 'Soyuz-U2')))
df.loc[filt, ['Return', 'Vehicle']]

                               Return        Vehicle
Spacecraft
STS-71, Atlantis  1995-07-07 14:55:19  Space Shuttle
STS-74, Atlantis  1995-11-20 17:02:43  Space Shuttle
STS-76, Atlantis  1996-03-31 13:30:04  Space Shuttle
STS-79, Atlantis  1996-09-26 12:14:49  Space Shuttle
STS-81, Atlantis  1997-01-22 14:23:23  Space Shuttle
STS-84, Atlantis  1997-05-24 13:28:48  Space Shuttle
STS-86, Atlantis  1997-10-06 09:56:19  Space Shuttle
STS-89, Endeavour 1998-01-31 22:36:15  Space Shuttle
STS-91, Discovery 1998-06-12 18:01:24  Space Shuttle

In [102]:
# Tilde to denotate the opposite of the filter
df.loc[~filt, ['Return', 'Vehicle']].head()

                                Return                          Vehicle
Spacecraft
Vostok 1           1961-04-21 07:55:00                         Vostok-K
Mercury-Redstone 3 1961-05-05 14:49:35  Mercury-Redstone Launch Vehicle
Mercury-Redstone 4 1961-07-21 12:36:13  Mercury-Redstone Launch Vehicle
Vostok 2           1961-08-07 07:18:00                         Vostok-K
Mercury-Atlas 6    1962-02-20 19:43:02                      Atlas LV-3B

In [110]:
df[df['Duration (days)'] < 1]['Vehicle'].isin(['Gemini 3', 'SpaceShipOne'])

Spacecraft
Vostok 1                   False
Mercury-Redstone 3         False
Mercury-Redstone 4         False
Mercury-Atlas 6            False
Mercury-Atlas 7            False
Mercury-Atlas 8            False
X-15, Flight 90            False
X-15, Flight 91            False
Gemini 3                   False
Gemini 8                   False
Soyuz 18A                  False
51-L, Challenger           False
Shenzhou 5                 False
SpaceShipOne, Flight 15     True
SpaceShipOne, Flight 16     True
SpaceShipOne, Flight 17     True
Soyuz MS-10                False
Name: Vehicle, dtype: bool